src/cf/InformationRegisters/инт_ОчередьОтправкиИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьОтправкиИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СформированноеСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Подписчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьОтправкиИсходящихСообщений/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_ОчередьОтправкиИсходящихСообщений
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Зарегистрировать сообщение к рассылке
// Процедура регистрирует сообщения для подписчиков
// Параметры:
//  ИдентификаторСообщения    -  УникальныйИдентификатор                - Уникальный идентификатор рассылаемого сообщения 
//  МассивПодписчиков         -  Массив        - Массив элементов СправочникСсылка.инт_Подписчики которым будет отправлено данное сообщение.
//
Процедура ЗарегистрироватьСообщениеКРассылкеПодписчикам(ИдентификаторСообщения, МассивПодписчиков) Экспорт
    
    Для Каждого Подписчик Из МассивПодписчиков Цикл
        ЗарегистрироватьСообщениеКРассылкеПодписчику(ИдентификаторСообщения, Подписчик);
    КонецЦикла;
    
КонецПроцедуры
  
// Процедура - Зарегистрировать сообщение к рассылке
// Процедура регистрирует сообщения для подписчиков
// Параметры:
//  ИдентификаторСообщения    -  УникальныйИдентификатор                - Уникальный идентификатор рассылаемого сообщения 
//  Подписчик         -  СправочникСсылка.инт_Подписчики        - Подписчик которому будет отправлено данное сообщение.
//
Процедура ЗарегистрироватьСообщениеКРассылкеПодписчику(ИдентификаторСообщения, Подписчик) Экспорт

    НачатьТранзакцию();
    Попытка
        Запись = РегистрыСведений.инт_ОчередьОтправкиИсходящихСообщений.СоздатьМенеджерЗаписи();
        Запись.ИдентификаторСообщения = ИдентификаторСообщения;
        Запись.Подписчик = Подписчик;
        Запись.Записать();
        
        РегистрыСведений.инт_ТекущийСтатусРассылкиСообщений.ЗаписатьСтатусСообщения(Запись.ИдентификаторСообщения,Подписчик, Перечисления.инт_СтатусыРассылкиИсходящихСообщений.Новый);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение ОписаниеОшибки();
    КонецПопытки;

КонецПроцедуры

// Процедура - Сформировать сообщение
//
// Параметры:
//  Сообщение     - Структура - Структура содержащая <ИдентификаторСообщения, Подписчик> 
//
Процедура СформироватьСообщение(Сообщение) Экспорт
	ДанныеИсходящегоСообщения = РегистрыСведений.инт_ОчередьИсходящихСообщений.ПолучитьДанныеОчередиПоИдентификатору(Сообщение.ИдентификаторСообщения, "СформированноеСообщение");
    
    //Когда потребуется реализовать разные настройки отправки - это можно сделать тут получая, допустим, отдельные настройки сериализации хранимые например в подписчике.
    СтрокаJSON = инт_КоннекторHTTP.ОбъектВJson(ДанныеИсходящегоСообщения.СформированноеСообщение);
    
    НачатьТранзакцию();
    Попытка
        ЗаписатьСформированноеСообщение(Сообщение.ИдентификаторСообщения, Сообщение.Подписчик, СтрокаJSON);
        РегистрыСведений.инт_ТекущийСтатусРассылкиСообщений.ЗаписатьСтатусСообщения(Сообщение.ИдентификаторСообщения, Сообщение.Подписчик, Перечисления.инт_СтатусыИсходящихСообщений.ГотовоКОтправке);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.ЗаписатьСтатусСообщения(Сообщение.ИдентификаторСообщения, Сообщение.Подписчик, Перечисления.инт_СтатусыИсходящихСообщений.ОшибкаФормирования, ПодробноеПредставлениеОшибки);
        СообщениеОбОшибке = СтрШаблон("При попытке сформировать сообщение с идентификатором <%1> для подписчика <%2> возникла ошибка.
        |
        |Информация об ошибке: %3", Сообщение.ИдентификаторСообщения, Сообщение.Подписчик, ПодробноеПредставлениеОшибки);
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковОтправкиСообщений", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
    КонецПопытки;
    
КонецПроцедуры

// Процедура - Отправить сообщение
// Пытается отправить сообщение способом указанным в подписчике.
// Параметры:
//   Сообщение     - Структура - Структура содержащая <ИдентификаторСообщения, Подписчик>  
//
Процедура ОтправитьСообщение(Сообщение) Экспорт
    ДанныеСообщения = РегистрыСведений.инт_ОчередьОтправкиИсходящихСообщений.СоздатьМенеджерЗаписи();
    ДанныеСообщения.ИдентификторСообщения = Сообщение.ИдентификторСообщения;
    ДанныеСообщения.Подписчик = Сообщение.Подписчик;
    ДанныеСообщения.Прочитать();
    
    //Получим поток данных, он будет необходим для отправки
    ДанныеИсходящегоСообщения = РегистрыСведений.инт_ОчередьИсходящихСообщений.ПолучитьДанныеОчередиПоИдентификатору(Сообщение.ИдентификаторСообщения, "ПотокДанных");
    ПотокДанных = ДанныеИсходящегоСообщения.ПотокДанных;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 Процедура ЗаписатьСформированноеСообщение(ИдентификаторСообщения, Подписчик, СформированноеСообщение)
  	Запись = РегистрыСведений.инт_ОчередьОтправкиИсходящихСообщений.СоздатьМенеджерЗаписи();
    Запись.ИдентификаторСообщения = ИдентификаторСообщения;
    Запись.Подписчик = Подписчик;
    Запись.Прочитать();
    Запись.СформированноеСообщение = СформированноеСообщение;
    Запись.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
